{
	"common": {
		"name": "plenticore",
		"version": "2.1.4",
		"news": {
			"2.1.4": {
				"en": "Disable smart battery control as long as SoC is lower than MinSoC + 8% to avoid using grid power on consumption peaks\nDisable darksky usage (discontinued)",
				"de": "Deaktivieren der intelligenten Batteriesteuerung, solange der SoC unter MinSoC + 8% liegt, um zu vermeiden, dass bei Verbrauchsspitzen Netzstrom verwendet wird\nDarksky-Nutzung deaktivieren (eingestellt)",
				"ru": "Отключите интеллектуальное управление батареей, пока SoC ниже MinSoC + 8%, чтобы избежать использования энергии сети при пиках потребления\nОтключить использование даркского (снято с производства)",
				"pt": "Desative o controle de bateria inteligente, desde que SoC seja inferior a MinSoC + 8% para evitar o uso de energia da rede em picos de consumo\nDesativar o uso do darksky (descontinuado)",
				"nl": "Schakel slimme batterijcontrole uit zolang SoC lager is dan MinSoC + 8% om te voorkomen dat het elektriciteitsnet wordt gebruikt bij verbruikspieken\nDarksky-gebruik uitschakelen (stopgezet)",
				"fr": "Désactivez le contrôle intelligent de la batterie tant que le SoC est inférieur à MinSoC + 8% pour éviter d'utiliser l'alimentation du réseau sur les pics de consommation\nDésactiver l'utilisation de Darksky (abandonné)",
				"it": "Disabilitare il controllo intelligente della batteria fintanto che SoC è inferiore a MinSoC + 8% per evitare di utilizzare la rete in caso di picchi di consumo\nDisabilita l'utilizzo di darksky (interrotto)",
				"es": "Desactive el control inteligente de la batería siempre que el SoC sea inferior a MinSoC + 8% para evitar el uso de la energía de la red en picos de consumo\nDeshabilitar el uso de darksky (descontinuado)",
				"pl": "Wyłącz inteligentną kontrolę baterii tak długo, jak SoC jest niższa niż MinSoC + 8%, aby uniknąć wykorzystywania mocy sieci w szczytach zużycia\nWyłącz użycie Darksky (wycofane)",
				"zh-cn": "只要SoC低于MinSoC + 8％，就禁用智能电池控制，以避免在功耗峰值时使用电网电源\n禁用深色天空用法（已停产）"
			},
			"2.1.3": {
				"en": "Fixed wrong hour of weather forecast from daswetter adapter",
				"de": "Falsche Stunde der Wettervorhersage vom Daswetter-Adapter",
				"ru": "Исправлен неправильный час прогноза погоды от адаптера Daswetter",
				"pt": "Corrigida a hora incorreta da previsão do tempo no adaptador daswetter",
				"nl": "Foutief weerbericht van daswetter-adapter opgelost",
				"fr": "Correction de la mauvaise heure de prévision météo de l'adaptateur daswetter",
				"it": "Risolto il problema con l'ora sbagliata delle previsioni del tempo dall'adattatore daswetter",
				"es": "Se corrigió la hora incorrecta del pronóstico del tiempo del adaptador daswetter",
				"pl": "Naprawiono błędną godzinę prognozy pogody z adaptera daswetter",
				"zh-cn": "修复了来自daswetter适配器的天气预报错误时间"
			},
			"2.1.2": {
				"en": "Added setting for minimum SoC to enable battery management",
				"de": "Einstellung für minimalen Ladezustand hinzugefügt, ab dem das Batteriemanagement aktiviert werden darf",
				"ru": "Добавлена настройка минимального SoC для включения управления батареей",
				"pt": "Configuração adicionada para SoC mínimo para permitir o gerenciamento da bateria",
				"nl": "Instelling toegevoegd voor minimale SoC om batterijbeheer mogelijk te maken",
				"fr": "Ajout d'un paramètre pour un SoC minimum pour permettre la gestion de la batterie",
				"it": "Aggiunta impostazione per SoC minimo per abilitare la gestione della batteria",
				"es": "Se agregó configuración para SoC mínimo para permitir la administración de la batería",
				"pl": "Dodano ustawienie minimalnego SoC, aby umożliwić zarządzanie baterią",
				"zh-cn": "添加了用于最小SoC的设置以启用电池管理"
			},
			"2.1.1": {
				"en": "Fixed problems in config and translations",
				"de": "Probleme in Konfiguration und Übersetzungen behoben",
				"ru": "Исправлены проблемы в конфиге и переводах",
				"pt": "Corrigidos problemas na configuração e traduções",
				"nl": "Vaste problemen in configuratie en vertalingen",
				"fr": "Correction de problèmes dans la configuration et les traductions",
				"it": "Risolti problemi di configurazione e traduzioni",
				"es": "Problemas resueltos en la configuración y las traducciones",
				"pl": "Naprawiono problemy z konfiguracją i tłumaczeniami",
				"zh-cn": "解决了配置和翻译中的问题"
			},
			"2.1.0": {
				"en": "Added further forecast sources to provide better power forecasts\nAdded second day forecast\nImproved code and fixed some minor issues\nNew dependency for xml2js",
				"de": "Weitere Prognosequellen hinzugefügt, um bessere Energieprognosen bereitzustellen\nPrognose für den zweiten Tag hinzugefügt\nVerbesserter Code und Behebung einiger kleinerer Probleme\nNeue Abhängigkeit für xml2js",
				"ru": "Добавлены дополнительные источники прогнозов для обеспечения лучших прогнозов мощности\nДобавлен прогноз на второй день\nУлучшен код и исправлены некоторые незначительные проблемы\nНовая зависимость для xml2js",
				"pt": "Adicionadas outras fontes de previsão para fornecer melhores previsões de energia\nPrevisão do segundo dia adicionada\nCódigo aprimorado e corrigidos alguns problemas menores\nNova dependência para xml2js",
				"nl": "Verdere bronnen voor prognoses toegevoegd om betere energieprognoses te bieden\nTweede dagvoorspelling toegevoegd\nVerbeterde code en enkele kleine problemen opgelost\nNieuwe afhankelijkheid voor xml2js",
				"fr": "Ajout de sources de prévisions supplémentaires pour fournir de meilleures prévisions de puissance\nAjout des prévisions du deuxième jour\nAmélioration du code et correction de quelques problèmes mineurs\nNouvelle dépendance pour xml2js",
				"it": "Aggiunte ulteriori fonti di previsione per fornire migliori previsioni di potenza\nAggiunta previsione secondo giorno\nCodice migliorato e risolti alcuni problemi minori\nNuova dipendenza per xml2js",
				"es": "Se agregaron más fuentes de pronóstico para proporcionar mejores pronósticos de potencia.\nPronóstico del segundo día agregado\nCódigo mejorado y solucionado algunos problemas menores\nNueva dependencia para xml2js",
				"pl": "Dodano dalsze źródła prognoz, aby zapewnić lepsze prognozy mocy\nDodano prognozę na drugi dzień\nPoprawiony kod i naprawione drobne problemy\nNowa zależność dla xml2js",
				"zh-cn": "添加了更多的预测源，以提供更好的功率预测\n添加了第二天的预测\n改进了代码并修复了一些小问题\nxml2js的新依赖项"
			},
			"2.0.0": {
				"en": "Code rework\nOursourcing of functions",
				"de": "Codeüberarbeitung\nOursourcing von Funktionen",
				"ru": "Переделка кода\nНаш поиск функций",
				"pt": "Retrabalho de código\nTerceirização de funções",
				"nl": "Code herwerken\nOursourcing van functies",
				"fr": "Refonte du code\nExternalisation des fonctions",
				"it": "Rielaborazione del codice\nSourcing di funzioni",
				"es": "Retrabajo de código\nNuestro abastecimiento de funciones",
				"pl": "Przeróbka kodu\nNasz outsourcing funkcji",
				"zh-cn": "代码返工\n我们的职能外包"
			},
			"1.1.1": {
				"en": "No changes",
				"de": "Keine Änderungen",
				"ru": "Без изменений",
				"pt": "Sem alterações",
				"nl": "Geen veranderingen",
				"fr": "Aucun changement",
				"it": "Nessun cambiamento",
				"es": "Sin cambios",
				"pl": "Bez zmian",
				"zh-cn": "没有变化"
			},
			"1.1.0": {
				"en": "Added support for weatherunderground weather adapter",
				"de": "Unterstützung für Weatherunderground-Wetteradapter hinzugefügt",
				"ru": "Добавлена поддержка погодного адаптера погоды под землей",
				"pt": "Adicionado suporte para o adaptador climático weatherunderground",
				"nl": "Ondersteuning toegevoegd voor de weeradapter voor weerweer",
				"fr": "Prise en charge supplémentaire de l'adaptateur météo Weatherunderground",
				"it": "Aggiunto supporto per adattatore meteorologico weatherunderground",
				"es": "Soporte agregado para el adaptador de clima subterráneo",
				"pl": "Dodano obsługę adaptera pogodowego Weatherunderground",
				"zh-cn": "添加了对Weatherunderground天气适配器的支持"
			},
			"1.0.2": {
				"en": "Fixed a warning message occuring far too often",
				"de": "Es wurde eine Warnmeldung behoben, die viel zu oft im Log auftrat",
				"ru": "Исправлено предупреждение, возникающее слишком часто",
				"pt": "Corrigida uma mensagem de aviso ocorrendo com muita frequência",
				"nl": "Een veel te vaak opgeloste waarschuwing opgelost",
				"fr": "Correction d'un message d'avertissement apparaissant trop souvent",
				"it": "Risolto un problema che si verificava troppo spesso",
				"es": "Se corrigió un mensaje de advertencia que ocurría con demasiada frecuencia",
				"pl": "Naprawiono zbyt częste wyświetlanie ostrzeżenia",
				"zh-cn": "修复了警告消息频繁出现的问题"
			},
			"1.0.1": {
				"en": "Added forecast information to README",
				"de": "Informationen zum Vorhersage-Feature zur README hinzugefügt",
				"ru": "Добавлена информация о прогнозе в README",
				"pt": "Adicionadas informações de previsão ao README",
				"nl": "Voorspellingsinformatie toegevoegd aan README",
				"fr": "Ajout d'informations sur les prévisions à README",
				"it": "Aggiunte informazioni sulla previsione a README",
				"es": "Se agregó información de pronóstico a README",
				"pl": "Dodano informacje o prognozie do README",
				"zh-cn": "向README添加了预测信息"
			},
			"1.0.0": {
				"en": "Added power forecast feature using DarkSky weather forecast adapter\nThis version has new and changed dependencies and requires further instance configuration.\nIt might be neccessary to delete the plenticore.X object tree before restarting the instance.",
				"de": "Power Forecast-Funktion mit DarkSky Weather Forecast-Adapter hinzugefügt\nDiese Version weist neue und geänderte Abhängigkeiten auf und erfordert eine weitere Instanzkonfiguration.\nMöglicherweise muss der plenticore.X-Objektbaum vor dem Neustart der Instanz gelöscht werden.",
				"ru": "Добавлена функция прогноза мощности с помощью адаптера прогноза погоды DarkSky\nЭта версия имеет новые и измененные зависимости и требует дальнейшей настройки экземпляра.\nМожет быть необходимо удалить дерево объектов plenticore.X перед перезапуском экземпляра.",
  				"pt": "Adicionado recurso de previsão de energia usando o adaptador de previsão meteorológica DarkSky\nEsta versão possui dependências novas e alteradas e requer configuração adicional da instância.\nPode ser necessário excluir a árvore de objetos plenticore.X antes de reiniciar a instância.",
				"nl": "Powerforecast-functie toegevoegd met de DarkSky-weersvoorspellingsadapter\nDeze versie heeft nieuwe en gewijzigde afhankelijkheden en vereist verdere instantieconfiguratie.\nHet kan nodig zijn om de plenticore.X-objectboom te verwijderen voordat u het exemplaar opnieuw start.",
  				"fr": "Ajout de la fonction de prévision de puissance à l'aide de l'adaptateur de prévision météo DarkSky\nCette version a des dépendances nouvelles et modifiées et nécessite une configuration d'instance supplémentaire.\nIl peut être nécessaire de supprimer l'arborescence d'objets plenticore.X avant de redémarrer l'instance.",
  				"it": "Aggiunta funzione di previsione della potenza utilizzando l'adattatore di previsioni del tempo DarkSky\nQuesta versione ha dipendenze nuove e modificate e richiede un'ulteriore configurazione dell'istanza.\nPotrebbe essere necessario eliminare l'albero degli oggetti plenticore.X prima di riavviare l'istanza.",
  				"es": "Se agregó la función de pronóstico de energía con el adaptador de pronóstico del tiempo DarkSky\nEsta versión tiene dependencias nuevas y modificadas y requiere una configuración de instancia adicional.\nPuede ser necesario eliminar el árbol de objetos plenticore.X antes de reiniciar la instancia.",
  				"pl": "Dodano funkcję prognozy mocy za pomocą adaptera prognozy pogody DarkSky\nTa wersja ma nowe i zmienione zależności i wymaga dalszej konfiguracji instancji.\nKonieczne może być usunięcie drzewa obiektów plenticore.X przed ponownym uruchomieniem instancji.",
  				"zh-cn": "使用DarkSky天气预报适配器添加了功率预报功能\n此版本具有新的和更改的依赖关系，并且需要进一步的实例配置。\n在重新启动实例之前，可能有必要删除plenticore.X对象树。"
			},
			"0.1.5": {
				"en": "Added translations and fixed shadow management handling.",
				"de": "Hinzugefügt Übersetzungen und feste Shadow-Management-Behandlung.",
				"ru": "Добавлены переводы и исправлена обработка теней.",
				"pt": "Traduções adicionadas e manipulação de gerenciamento de sombra fixa.",
				"nl": "Vertalingen toegevoegd en verwerking van vast schaduwbeheer.",
				"fr": "Ajout de traductions et correction de la gestion de l'ombre.",
				"it": "Aggiunte traduzioni e gestione fissa della gestione delle ombre.",
				"es": "Se agregaron traducciones y se corrigió el manejo de la sombra.",
				"pl": "Dodano tłumaczenia i poprawiono obsługę zarządzania cieniem.",
				"zh-cn": "添加了翻译和固定的阴影管理处理。"
			},
			"0.1.4": {
				"en": "Added shadow management datapoint.",
				"de": "Datenpunkt für Schattenmanagement hinzugefügt.",
				"ru": "Добавлено назначение данных для управления тенями",
				"pt": "Ponto de dados adicionado para gerenciamento de sombra",
				"nl": "Datapunt toegevoegd voor schaduwbeheer",
				"fr": "Point de données ajouté pour la gestion des ombres",
				"it": "Aggiunto datapoint per la gestione delle ombre",
				"es": "Punto de datos agregado para la gestión de sombra",
				"pl": "Dodano punkt danych do zarządzania cieniem",
				"zh-cn": "添加了用于阴影管理的数据点"
			},
			"0.1.3": {
				"en": "Do not query battery values if battery management is not unlocked.",
				"de": "Keine Abfragen zu Batteriewerten, wenn Batteriemanagement im WR nicht freigeschaltet wurde.",
				"ru": "Не запрашивать значения батареи, если управление батареей не разблокировано",
				"pt": "Não consulte os valores da bateria se o gerenciamento da bateria não estiver desbloqueado",
				"nl": "Vraag geen batterijwaarden als batterijbeheer niet is ontgrendeld",
				"fr": "Ne pas interroger les valeurs de la batterie si la gestion de la batterie n'est pas déverrouillée",
				"it": "Non interrogare i valori della batteria se la gestione della batteria non è sbloccata",
				"es": "No consulte los valores de la batería si la administración de la batería no está desbloqueada",
				"pl": "Nie sprawdzaj wartości baterii, jeśli zarządzanie baterią nie jest odblokowane",
				"zh-cn": "如果未解锁电池管理，请勿查询电池值"
			},
			"0.1.2": {
				"en": "Resolved adapter check issues, see https://github.com/StrathCole/ioBroker.plenticore/issues/1\nAdded statistics data points.",
				"de": "Adapter-Review-Fehler behoben, siehe https://github.com/StrathCole/ioBroker.plenticore/issues/1\nStatistik-Datenpunkte hinzugefügt.",
				"ru": "Устранены проблемы с проверкой адаптера, см. Https://github.com/StrathCole/ioBroker.plenticore/issues/1\nДобавлены точки статистики.",
				"pt": "Problemas resolvidos de verificação do adaptador, consulte https://github.com/StrathCole/ioBroker.plenticore/issues/1\nPontos de dados estatísticos adicionados.",
				"nl": "Problemen met adaptercontroles opgelost, zie https://github.com/StrathCole/ioBroker.plenticore/issues/1\nstatistische gegevenspunten toegevoegd.",
				"fr": "Problèmes de vérification de l'adaptateur résolus, voir https://github.com/StrathCole/ioBroker.plenticore/issues/1\nAjout de points de données statistiques.",
				"it": "Risolti i problemi di controllo dell'adattatore, consultare https://github.com/StrathCole/ioBroker.plenticore/issues/1\nAggiunti punti dati statistici.",
				"es": "Problemas resueltos de verificación del adaptador, consulte https://github.com/StrathCole/ioBroker.plenticore/issues/1\npuntos de datos estadísticos agregados.",
				"pl": "Rozwiązane problemy z sprawdzaniem adaptera, patrz https://github.com/StrathCole/ioBroker.plenticore/issues/1\nDodano punkty danych statystycznych.",
				"zh-cn": "已解决的适配器检查问题，请参阅https://github.com/StrathCole/ioBroker.plenticore/issues/1\n加了统计数据点。"
			},
			"0.1.1": {
				"en": "Removed admin adapter dependency",
				"de": "Abhängigkeit zu Admin-Adapter entfernt",
				"ru": "Удалена зависимость адаптера администратора",
				"pt": "Removida a dependência do adaptador de administrador",
				"nl": "Afhankelijkheid van admin-adapter verwijderd",
				"fr": "Suppression de la dépendance de l'adaptateur administrateur",
				"it": "Dipendenza dell'adattatore dell'amministratore rimossa",
				"es": "Se eliminó la dependencia del adaptador de administrador",
				"pl": "Usunięto zależność adaptera administratora",
				"zh-cn": "删除了管理适配器依赖项"
			},
			"0.1.0": {
				"en": "Initial version",
				"de": "Initiale Version",
				"ru": "Первоначальный вариант",
				"pt": "Versão inicial",
				"nl": "Eerste versie",
				"fr": "Version initiale",
				"it": "Versione iniziale",
				"es": "Versión inicial",
				"pl": "Początkowa wersja",
				"zh-cn": "初始版本"
			}
		},
		"title": "KOSTAL Plenticore API",
		"titleLang": {
			"en": "KOSTAL Plenticore API",
			"de": "KOSTAL Plenticore API",
			"ru": "KOSTAL Plenticore API",
			"pt": "API do KOSTAL Plenticore",
			"nl": "KOSTAL Plenticore API",
			"fr": "API KOSTAL Plenticore",
			"it": "API KOSTAL Plenticore",
			"es": "API de Plenticore de KOSTAL",
			"pl": "KOSTAL Plenticore API",
			"zh-cn": "KOSTAL Plenticore API"
		},
		"desc": {
			"en": "Adapter to communicate with a KOSTAL Plenticore Plus via local network (non-modbus)",
			"de": "Adapter um mit einem KOSTAL Plenticore Plus im lokalen Netzwerk (nicht via modbus) zu kommunizieren",
			"ru": "Адаптер для связи с KOSTAL Plenticore Plus через локальную сеть (не по протоколу Modbus)",
			"pt": "Adaptador para se comunicar com um KOSTAL Plenticore Plus via rede local (não modbus)",
			"nl": "Adapter voor communicatie met een KOSTAL Plenticore Plus via lokaal netwerk (niet-modbus)",
			"fr": "Adaptateur pour communiquer avec un KOSTAL Plenticore Plus via un réseau local (non modbus)",
			"it": "Adattatore per comunicare con un KOSTAL Plenticore Plus tramite rete locale (non modbus)",
			"es": "Adaptador para comunicarse con KOSTAL Plenticore Plus a través de la red local (no modbus)",
			"pl": "Adapter do komunikacji z KOSTAL Plenticore Plus za pośrednictwem sieci lokalnej (non-modbus)",
			"zh-cn": "通过本地网络（非Modbus）与KOSTAL Plenticore Plus进行通信的适配器"
		},
		"authors": [
			"Marius Burkard <m.burkard@pixcept.de>"
		],
		"platform": "Javascript/Node.js",
		"main": "main.js",
		"mode": "daemon",
		"icon": "plenticore.png",
		"extIcon": "https://raw.githubusercontent.com/StrathCole/ioBroker.plenticore/master/admin/plenticore.png",
		"keywords": [
			"kostal",
			"plenticore",
			"api",
			"inverter"
		],
		"readme": "https://github.com/StrathCole/ioBroker.plenticore/blob/master/README.md",
		"loglevel": "info",
		"type": "energy",
		"connectionType": "local",
		"dataSource": "pull",
		"license": "MIT",
		"messagebox": true,
		"materialize": true,
		"enabled": false,
		"compact": true,
		"stopTimeout": 2000,
		"dependencies": [
		]
	},
	"native": {
		"ipaddress": "",
		"password": "",
		"pollinterval": 20000,
		"wfc_instance": "",
		"enable_minsoc": false,
		"enable_battery_management": false,
		"enable_bm_minsoc": 10,
		"min_minsoc": 5,
		"max_minsoc": 40,
		"battery_capacity": 0,
		"panel_tilt": 30,
		"panel_dir": 180,
		"panel_surface": 0,
		"panel_efficiency": 19.2
	},
	"objects": [],
	"instanceObjects": [
		{
			"_id": "info",
			"type": "channel",
			"common": {
				"name": "Adapter-Information"
			},
			"native": {}
		},
		{
			"_id": "info.connection",
			"type": "state",
			"common": {
				"role": "indicator.connected",
				"name": "Whether the adapter is connected to the gateway",
				"type": "boolean",
				"read": true,
				"write": false,
				"def": false
			},
			"native": {}
		}
	]
}
